In [38]:
import pandas as pd

In [39]:
salary_data = pd.read_csv("Salary_Data.csv")

In [40]:
salary_data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [41]:
salary_data["Gender"] = salary_data["Gender"].map({"Male": "M", "Female": "F"})

In [42]:
salary_data.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [43]:
salary_data.shape

(6704, 6)

In [44]:
salary_data.drop('Age', axis=1, inplace=True)

In [45]:
salary_data.head()

  Gender Education Level          Job Title  Years of Experience    Salary
0      M      Bachelor's  Software Engineer                  5.0   90000.0
1      F        Master's       Data Analyst                  3.0   65000.0
2      M             PhD     Senior Manager                 15.0  150000.0
3      F      Bachelor's    Sales Associate                  7.0   60000.0
4      M        Master's           Director                 20.0  200000.0

In [46]:
df_female = salary_data[salary_data["Gender"] == "F"]
df_male = salary_data[salary_data["Gender"] == "M"]

In [47]:
df_female.head()

,Gender,Education Level,Job Title,Years of Experience,Salary
1,F,Master's,Data Analyst,3.0,65000.0
3,F,Bachelor's,Sales Associate,7.0,60000.0
6,F,Master's,Product Manager,12.0,120000.0
8,F,Bachelor's,Marketing Coordinator,1.0,45000.0
11,F,Bachelor's,HR Manager,18.0,140000.0

In [48]:
df_male.head()

  Gender Education Level          Job Title  Years of Experience    Salary
0      M      Bachelor's  Software Engineer                  5.0   90000.0
2      M             PhD     Senior Manager                 15.0  150000.0
4      M        Master's           Director                 20.0  200000.0
5      M      Bachelor's  Marketing Analyst                  2.0   55000.0
7      M      Bachelor's      Sales Manager                  4.0   80000.0

In [49]:
df_female.shape

(3014, 5)

In [50]:
df_male.shape

(3674, 5)

In [107]:
df_male_avg = df_male.groupby(["Job Title", "Education Level", "Years of Experience"])["Salary"].mean()

In [101]:
df_female_avg = df_female.groupby(["Job Title", "Education Level", "Years of Experience"])["Salary"].mean()

In [109]:
df_female_avg.head(20)

Job Title                 Education Level    Years of Experience
Accountant                Bachelor's         4.0                     55000.000000
Administrative Assistant  Bachelor's         8.0                     45000.000000
                                             10.0                    55000.000000
Back end Developer        Bachelor's Degree  1.0                     59349.166667
                                             3.0                     81666.666667
                                             5.0                     77766.000000
                                             10.0                   114776.000000
                                             18.0                   155795.000000
                                             19.0                   140464.833333
                          High School        0.0                     51832.000000
                                             1.0                     52807.000000
                                             2.0                     62807.000000
                          Master's Degree    1.0                     60000.000000
                                             2.0                     70000.000000
                                             3.0                     90000.000000
                                             4.0                     73938.000000
                                             5.0                    110000.000000
                                             6.0                    130000.000000
                                             9.0                    124141.000000
                                             10.0                   155000.000000
Name: Salary, dtype: float64

In [110]:
df_male_avg.head(20)

Job Title           Education Level    Years of Experience
Account Manager     Bachelor's         5.0                     75000.000000
Back end Developer  Bachelor's Degree  1.0                     55467.500000
                                       2.0                     70061.166667
                                       3.0                     80719.428571
                                       4.0                     84074.153846
                                       5.0                    100000.000000
                                       6.0                    107500.000000
                                       8.0                    124208.900000
                                       10.0                   116934.714286
                                       12.0                   132321.500000
                                       14.0                   136449.000000
                                       16.0                   137489.000000
                                       18.0                   150901.000000
                                       23.0                   175966.000000
                                       24.0                   178284.000000
                                       25.0                   168287.000000
                    High School        3.0                     68611.000000
                                       4.0                     80127.000000
                                       7.0                     95845.000000
                    Master's Degree    0.0                     55538.000000
Name: Salary, dtype: float64

In [111]:
df_male_avg = df_male_avg.reset_index()
df_female_avg = df_female_avg.reset_index()

In [113]:
df_male_avg = df_male_avg.rename(columns={'Salary': 'Salary_M'})
df_female_avg = df_female_avg.rename(columns={'Salary': 'Salary_F'})

In [115]:
merged = df_male_avg.merge(
    df_female_avg,
    on=['Job Title', 'Education Level'],
    how='inner'
)

In [116]:
merged = merged[
    merged['Years of Experience_y'].sub(merged['Years of Experience_x']).abs() <= 1
]

In [117]:
merged = merged.rename(columns={
    'Years of Experience_x': 'Years_Exp_M',
    'Years of Experience_y': 'Years_Exp_F'
})

In [118]:
merged['Salary_Diff'] = merged['Salary_M'] - merged['Salary_F']

In [120]:
merged.shape

(545, 7)

In [121]:
entries = []
for _, row in merged.iterrows():
    entry = f"""Job Title: {row['Job Title']}
Education Level: {row['Education Level']}
Experience (Male): {row['Years_Exp_M']}
Experience (Female): {row['Years_Exp_F']}
Average Male Salary: {row['Salary_M']:.2f}
Average Female Salary: {row['Salary_F']:.2f}
Difference: {row['Salary_Diff']:.2f}
"""
    entries.append(entry)

In [123]:
with open("salary_comparison_entries.txt", "w") as f:
    for entry in entries:
        f.write(entry + "\n\n")